// напишите программу, которое на вход принимает число и выдает его квадрат (число умноженное
// на само себя)

// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

int number = 4;
int result = number * number;
Console.WriteLine(result);
